/**
 * description data of each dish
 */

import { DishDesc } from "../model/DishDesc"

export const dishesDesc: DishDesc = {
  // 宫保鸡丁
  kpchicken: "\t宫保鸡丁是一道闻名中外的特色传统名菜，该菜式的起源与鲁菜中的酱爆鸡丁、贵州菜中的胡辣子鸡丁有关，后被清朝山东巡抚、四川总督丁宝桢改良发扬，形成了一道新菜式——宫保鸡丁，并流传，此道菜也被归纳为北京宫廷菜。",
  // 孜然土豆牛肉
  beefpotato: "\t牛肉是滋养强壮的补品，具有健脾养胃，强筋壮骨之功。除了牛肉和土豆，适量添加胡萝卜、青椒等蔬菜，既丰富了整菜的营养价值，并且可以有效地改善菜品单调的色泽，同时也可以相对减轻我们肠胃的负担。",
  // 凉拌菠菜
  spinach: "\t菠菜有促进生长发育、增强抗病能力能维护正常视力和上皮细胞的健康，增加预防传染病的能力。而菠菜的吃法中，凉拌是一个不错的选择，因为凉拌菠菜是一道营养价值很高的菜肴，大家都知道经过煸炒的蔬菜营养都会流失很多，而凉拌的就不会出现这样的情况，多吃对人体有非常大的好处。",
  // 拍黄瓜
  cucumber: "\t家中常吃的菜肴之一就是拍黄瓜，黄瓜含有很多碳水化合物和丰富的维生素。它的准备过程很简单，并且可以一次多做一些酱汁，吃的时候舀上几勺就好了。",
  // 紫菜蛋花汤
  eggsoup: "\t紫菜是一种海藻，营养丰富，味道鲜美，晒干后的紫菜比纸片还要薄，在开水里泡一下就熟了，也能发挥紫菜最佳的鲜味和口感。紫菜蛋花汤还有一个关键点就是“蛋花”，如何让鸡蛋花悬浮在汤中才是这道汤成功的关键。",
  // 炸红薯球
  sweetpotato: "\t红薯生食脆甜，可代替水果；熟食甘软，吃在嘴里，甜在心头。它既可作主食，又可当蔬菜。蒸、煮、煎、炸，吃法众多，一经巧手烹饪，也能成为席上佳肴。红薯有抗癌作用，饮食中最具有抗癌作用的营养物质是β-胡萝卜素、维生素C和叶酸，而在红薯中三者含量都比较丰富。",
  // 黑椒鸡块
  firedchicken: "\t鸡胸肉具有高蛋白低脂肪的特点，家庭版的自制黑椒鸡块，比快餐店更健康，可当作小零食。",
  // 舒芙蕾
  souffle: "\t舒芙蕾也被称作蛋奶酥，是一种源自法国的甜点。这是一道温热的甜点，必须趁热食用，因为一旦从烤箱取出，蓬松的蛋糕体便会慢慢塌陷，虽然美丽却稍纵即逝，所以不能提前制作。舒芙蕾美味的关键在于轻盈绵密湿润的口感，因此面糊中各种材料的比列和面糊状态非常重要。",
  // 牛角包
  croissant: "\t可颂是一款久负盛名的法式面包，它的英文名称为croissant。由于形状的原因，人们又称它为牛角面包、羊角面包或新月面包。从面包分类上来说，可颂只是属于丹麦面包大类中的一种。丹麦面包又叫起酥面包，是用酥皮面团烘烤而成的。",
  // 毛血旺
  maoxuewang: "\t毛血旺是川菜的一道特色名菜，也是重庆江湖菜的鼻祖之一，已经列入国家标准委员会《渝菜烹饪标准体系》。毛血旺以鸭血为制作主料，烹饪技巧以煮菜为主，口味属于麻辣味。其起源于重庆，流行于西南地区，是一道著名的传统菜式，这道菜是将生血旺现烫现吃，且毛肚杂碎为主料，遂得名。",
  // 油闷大虾
  prawn: "\t油焖大虾是一道经典的鲁菜，油焖是一种传统的烹饪方式，较多的油脂通过焖煮，让原料上形成一层油膜，起到密封保温的作用，让食材的本味锁在其中，吃起来香味浓郁，做法和调味比较多样。",
  // 紫米粥
  zimi: "\t紫米粥是一道由紫米为主要材料，黄砂糖、水等为辅料制作而成的粥品，属于家常菜粥。该道菜品通过将食材进行大火煮开转小火炖煮的方法制作而成。"
}